# Pinned Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..Pinned Property
Element Class See Also
---
Identifies if the element has been pinned to prevent changes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Pinned { get; set; }
```

Visual Basic
---
```text
Public Property Pinned As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Pinned {
	bool get ();
	void set (bool value);
}
```

# Remarks
An element which is pinned may not be moved, and warnings will be issued when an attempt is made to delete it.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: Element cannot be pinned or unpinned. |

# See Also
Element Class
Autodesk.Revit.DB Namespace